app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "sunny"], ["text", "jkfh"], ["created_at", "2018-06-22 11:21:42.320900"], ["updated_at", "2018-06-22 11:21:42.320900"]]
---
	def create
		p "=====================hello i m here================"
		title = params[:post][:title]
		text = params[:post][:text]
		# user = "1"
		post_params = {
			title: title,
			text: text,
			# user_id: user
		}
		@post = Post.new(post_params)
		if @post.save